{
  "url": "https://emeraldowlproductions.com/contact-us",
  "title": "Contact Us",
  "route": "/contact-us",
  "meta": {
    "description": "Contact us to discuss scheduling one of our many services for your events.",
    "keywords": ""
  },
  "content": {
    "main_text": "Contact Us Home Our Experiences Laser Light Show The Safest Experience in the Sky Unique Benefits of Hosting a Laser Show Neon Nights Foam Parties Water Games Dripping in Confidence Gunge Sensory Friendly Experiences Do It Now Coming Soon Special Occasions Upcoming Events Holiday Events America's 250th Anniversary Fundraisers Emmy The Owl Contact Us More... Our Story Our Team Gallery Blog Careers Contact Us Phone: 252.764.7628 Email: [email protected] PO Box 4911, Emerald Isle, North Carolina 28594 Facebook Instagram First Name Last Name Phone * Email * Contact Us Privacy Policy | Terms of Service StrategixAI FAQ What is the difference between a laser show and a laser light glow in the dark dance party? A laser show is typically a 20-30 minute customized show that synchronizes laser lights with music. Laser shows might be done to celebrate a season (Halloween, Christmas, 4th of July, etc.), a certain musical genre (80's, Top 40, Hip Hop, Country), or even a particular artist. Laser shows can also incorporate different themes (sports, religious, marine life, etc.) The show can easily be be repeated during an event without adding any overhead. (Ex: Laser Show every night at set times to celebrate a special week in town). A laser light glow in the dark dance party is a high energy performance that turns any venue into sort of a night club atmosphere. The glow in the dark aspect is created by powerful UV lights so anything that glows in the dark will pop. It also includes lasers, along with other professional moving lights, and high quality sound. The dance party might also include accessories such as a video projection screen to display music videos, a snow machine, foam machine, etc. A dance party can last 3-5 hours. Laser beams create a tremendous visual impact for your participants. For smaller budgets, we recommend eliminating the lasers and focusing on the glow in the dark aspect. We can still throw quite a party. Can we do the event outside? Yes. We can do laser shows and laser light dance parties inside or outside. Keep in mind that an outdoor performance will often be more costly than an indoor event for several reasons. This is because it takes higher wattage lasers to obtain a stronger visual impact when outside. With indoor events, we can create a strong impact with lower wattage lasers by simply putting haze in the air. Keep in mind that if we are unable to terminate laser beams outside (such as on the side of a building, a large screen, a big truck, etc.), we will need to file a notice at least 30 days in advance with the FAA to obtain a letter of non-objection. The time required to do this paperwork will be considered when we give you a quote. Why do you use haze inside? It might set off our fire alarms! In order for laser beams to be seen by the human eye  while they are in the air, there must be particles in the air. The laser beams deflect off these particles, which is what creates the visual impact of a laser show. If you air is clear, as it normally would be inside, you will not be able to see the laser beams as they travel. Therefore, haze is a safe way to get those particles in the air. Without the haze, we are unable to give you the value and wow factor for which you are paying us to do. See this short video for an example of the impact haze has on the visual experience. www.youtube.com/watch?v=diSVxb1ogk4 Ok, we understand we need haze. But what about our fire alarms? Can we even do this? Yes you can. Haze machines are different than a standard smoke machine. It is much less thick and designed not to set off alarms. Our haze is not flammable or hot so if your sensors are heat activated, there is never a problem.  However, some particle activated alarms will still sound depending where your sensors are and how sensitive they are. There are two proactive ways to resolve this concern: 1) Put your alarms on test mode and designate 1-2 people to be on fire watch. This is totally appropriate and approved by most fire departments. The people should be responsible adults and MUST ONLY be on fire watch. They cannot have ANY other responsibilities at your event and they should have a large air horn in case of emergency. 2) Contact your fire department in advance and offer to pay someone an hourly rate to be on site. If your alarm sounds, the fire department can verify there is no fire and reset the alarm without a  mandatory evacuation. We have heard your rates are higher than local DJs and bands? Is that true? Emerald Owl Productions is the company we want you to call when you want a special \"Wow\" factor at your event. As our name indicates, we bring a production to your venue. We are building our brand based on superior quality and adding unmeasurable value to your event. Our vision is not to be a DJ service, but rather to bring big city quality entertainment to anytown USA! In short, comparing us to DJ or band rates is probably not the proper comparison. In fact, we sometimes contract with DJs who want our professional lighting and lasers at their event. A professional laser show and laser light dance party is a cost efficient alternative to a large fireworks production. If you compare our rates with a large fireworks show, you will find our rates to be extremely competitive. (Also keep in mind a laser light and glow dance party might last for 4 hours and is extremely interactive-- much longer than a fireworks show where participation is passive) Why are your rates for your productions not published? That is a fair and understandable question. However, in order to give you the best quote possible, we need to meet with you so we can discuss your vision of a wonderful event and get specifics about your venue. Consider a fireworks show in New York City and a fireworks show in a small American town. Both are fireworks shows, but the budgets and participant experience will be very different. This is the same with our services. Some of the factors we will discuss are your expected attendance, if your event is outdoor or indoor, how much power is available at the venue, do you need lasers synchronized to music,  do you need sound, and if so, how much? We also will ask you for an approximate budget. Our job is then to take your vision of a wonderful event and your budget to make numbers work for everyone. If we cannot give you a high quality event at the budget you give us, we will give you suggestions as to how you might be able to gets costs covered. We never want cost to be the only barrier to forming a partnership with you, so please ask us. We can also sometimes work with you on a better rate if your date can be flexible or during the week. How much power is needed? As with anything, it will depend on how big of a production we are doing. Typically we will require four to five 20-amp circuits. If this much power is not available, we have a distro box that can be wired straight into your breaker, which provide the needed power. This will need to be done by an electrician and typically will be $100 or less. We provide the distro box for a small fee, usually in the $150 range, but you will be responsible to get the electrician. The distro box will not be needed if you have enough available power on site. Certain generators can also work. Talk to us if you want to go the generator route. Why does a laser show company do school fundraisers? We never heard of anything like this. This is what sets us apart from really anyone else. We bring over 30 years of production experience and 16 years of fundraising experience to form a truly unique way to raise profit in a way that is fun, interactive, and memorable. Please look at the \"Education/Fundraising Division\" to learn more. Where To Find Us Emerald Owl Productions OUR TEAM OUR STORY CONTACT US BLOG TERMS OF USE PRIVACY POLICY FOLLOW US Copyright 2025. Emerald Owl Productions.\nAll Rights Reserved.",
    "sections": []
  },
  "resources": [
    {
      "type": "image",
      "url": "https://storage.googleapis.com/msgsndr/d2BYZGOF7ecSj21A0t4N/media/6704204d9d9a095a00d5b580.png",
      "alt": "Emerald Owl Productions",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://images.leadconnectorhq.com/image/f_webp/q_80/r_1200/u_https://assets.cdn.filesafe.space/d2BYZGOF7ecSj21A0t4N/media/6713c58f138c1957a458c7f4.jpeg",
      "alt": "",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://images.leadconnectorhq.com/image/f_webp/q_100/r_1000/u_https://storage.googleapis.com/highlevel-backend.appspot.com/location/d2BYZGOF7ecSj21A0t4N/form/JgqE60ya67aZxiRoebcZ/header-image/b23aadb3-a5e5-4ec5-9a80-8d2353de5be7.png",
      "alt": "banner",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://msgsndr-private.storage.googleapis.com/companyPhotos/6c41a800-ef09-479b-a7d8-3beb91f1f37b.png",
      "alt": "",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://images.leadconnectorhq.com/image/f_webp/q_80/r_1200/u_https://firebasestorage.googleapis.com/v0/b/highlevel-backend.appspot.com/o/location%2Fd2BYZGOF7ecSj21A0t4N%2Fimages%2FQbqljDKSEppADjhoDkhr%2FChIJVVAbbHbwqIkR3JfaN5abZAA%2Fmap-oagbOPoIJH.jpg?alt=media",
      "alt": "Emerald Isle, NC 28594, USA",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://images.leadconnectorhq.com/image/f_webp/q_80/r_1200/u_https://assets.cdn.filesafe.space/d2BYZGOF7ecSj21A0t4N/media/6704204d9d9a095a00d5b580.png",
      "alt": "",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/facebook-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/instagram-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/linkedin-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/youtube-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    }
  ]
}