{
  "url": "https://emeraldowlproductions.com/doitnow",
  "title": "Do It Now Initiative - Emerald Owl Productions",
  "route": "/doitnow",
  "meta": {
    "description": "",
    "keywords": ""
  },
  "content": {
    "main_text": "Home Our Experiences Laser Light Show The Safest Experience in the Sky Unique Benefits of Hosting a Laser Show Neon Nights Foam Parties Water Games Dripping in Confidence Gunge Sensory Friendly Experiences Do It Now Coming Soon Special Occasions Upcoming Events Holiday Events America's 250th Anniversary Fundraisers Emmy The Owl Contact Us More... Our Story Our Team Gallery Blog Careers Do It Now Initiative - Emerald Owl Productions Why \"Do It Now\"? In memory of Matthew Keenan Matthew Keenan was more than a friend — he was the heartbeat of Emerald Owl Productions. As our Vice President and Head Laser Technician, he poured passion into every show, every project, and every connection. He brought light — literally and figuratively — to every experience he worked on. In 2023, Matthew's life was tragically cut short in a car accident — one that was 100% not his fault. He was simply in the wrong place at the wrong time, and the world lost someone extraordinary. In the days that followed, we kept hearing the same words: \"I wish I had told him...\" \"I regret not saying...\" The Do It Now initiative was born from that ache — and that love. This card is a reminder to act on the things that matter. To say \"I miss you.\" To say \"Thank you.\" To say \"I love you.\" To say \"I'm sorry.\" To call or write the person you've been thinking about. To take the leap. To say the words — now, while you still can. To live and love like there's no time to waste. Don't wait. Do it now. The Safest Experience in the Sky Why Are Laser Shows the Safest Option for Entertainment? ✓ Environmentally Friendly No debris, smoke, or chemical residue - just pure light entertainment ✓ Weather Resilient Shows go on in various weather conditions, reducing last-minute cancellations ✓ Noise-Friendly Silent operation perfect for sensitive communities and wildlife Learn More About Laser Show Safety → 🔒 All our shows are fully compliant with FDA regulations and operated by certified technicians Unique Benefits of Hosting a Laser Show Transform your event into an unforgettable experience Customizable & Scalable Perfect for any scale - from intimate gatherings to major festivals. Fully tailored to your event's theme and goals. Cost-Effective Add extra shows or nights at minimal cost. Perfect for fundraising events and multi-day festivals. Versatile Integration Works perfectly as a standalone event or enhances existing performances with live music and entertainment. Sponsorship Opportunities Engage sponsors with brilliant laser projections of logos and brand messages, creating unique promotional opportunities. Discover All Benefits → 💡 Contact us to learn how we can customize a laser show experience for your specific needs LASER SHOW PRICING Laser shows are unique entertainment options where you need details to get an accurate quote. Different needs and budgets can be accommodated, scaling the spectacle up or down. To discuss a laser show for your event, call us at 252-764-7628 without any sales pressure. During the call, we'll discuss your objectives, desired show type (beam, graphic or combo), venue specifics, anticipated audience size, sound and power requirements, location, whether it’s a solo event, customized music needs, and your budget. Our talented programmers design shows to music and offer package deals for multi-night events, reducing the cost per night significantly. One-time shows are pricier due to fixed overheads, but shared packages or revenue-split events can make them more affordable. At Emerald Owl Productions, we aim to find the right balance for a memorable laser show experience within your budget—multiple nightly shows also hardly impact the price. Once we have the initial details, future planning becomes simpler. We strive to overcome pricing challenges and bring your event to life, so let's collaborate! LASER SHOW PRICING Laser shows are unique entertainment options where you need details to get an accurate quote. Different needs and budgets can be accommodated, scaling the spectacle up or down. To discuss a laser show for your event, call us at 252-764-7628 without any sales pressure. During the call, we'll discuss your objectives, desired show type (beam, graphic or combo), venue specifics, anticipated audience size, sound and power requirements, location, whether it’s a solo event, customized music needs, and your budget. Our talented programmers design shows to music and offer package deals for multi-night events, reducing the cost per night significantly. One-time shows are pricier due to fixed overheads, but shared packages or revenue-split events can make them more affordable. At Emerald Owl Productions, we aim to find the right balance for a memorable laser show experience within your budget—multiple nightly shows also hardly impact the price. Once we have the initial details, future planning becomes simpler. We strive to overcome pricing challenges and bring your event to life, so let's collaborate! Contact US for Pricing Emerald Owl Productions OUR TEAM OUR STORY CONTACT US BLOG TERMS OF USE PRIVACY POLICY FOLLOW US Copyright 2025. Emerald Owl Productions.\nAll Rights Reserved.",
    "sections": []
  },
  "resources": [
    {
      "type": "image",
      "url": "https://storage.googleapis.com/msgsndr/d2BYZGOF7ecSj21A0t4N/media/6704204d9d9a095a00d5b580.png",
      "alt": "Emerald Owl Productions",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://storage.googleapis.com/msgsndr/d2BYZGOF7ecSj21A0t4N/media/67f0228e28ec4ccbf50b8915.jpeg",
      "alt": "Don't Wait - Do It Now Initiative",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://images.leadconnectorhq.com/image/f_webp/q_80/r_1200/u_https://assets.cdn.filesafe.space/d2BYZGOF7ecSj21A0t4N/media/6704204d9d9a095a00d5b580.png",
      "alt": "",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/facebook-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/instagram-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/linkedin-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/youtube-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    }
  ]
}