{
  "url": "https://emeraldowlproductions.com/fundraisers",
  "title": "Fundraisers",
  "route": "/fundraisers",
  "meta": {
    "description": "",
    "keywords": ""
  },
  "content": {
    "main_text": "Home Our Experiences Laser Light Show The Safest Experience in the Sky Unique Benefits of Hosting a Laser Show Neon Nights Foam Parties Water Games Dripping in Confidence Gunge Sensory Friendly Experiences Do It Now Coming Soon Special Occasions Upcoming Events Holiday Events America's 250th Anniversary Fundraisers Emmy The Owl Contact Us More... Our Story Our Team Gallery Blog Careers Fundraisers Fundraisers EOP is endorsed by The National Forum to Accelerate Middle-Grades Reform. ​Read their endorsement HERE FUNDRAISING WITH EOP We have programs specifically designed for schools, churches, or other non-profits. We have taken the time off during COVID-19 to completely restructure our fundraising model to give our partners more choices to fit different needs, goals, volunteer availability, and potential event participants. One thing that will not change is that EOP puts an emphasis on creating more experiences for students and staff without selling more overpriced stuff. Memories last forever -- stuff does not! There are typically 3 types of experiences we offer when it comes to fundraising: 1) Participants are for organization (or club) members only: These are smaller events that take less advance planning. Because the overall number of participants is small, we choose experiences with less overhead so that the event is profitable. The advantage of these events is they are simpler and often are a fun bonding experience for the members of your organization. The disadvantage is that a smaller event limits the amount of possible profit. 2) School fundraiser: An organization or school creates an event that invites all students These have the potential to be significantly larger events because all students are invited. We have found if the rate for non-members to participate is similar to other entertainment options in the area, non-members will often still participate if the experience is deemed to be of interest. These events have more moving parts, and thus more advanced planning and organization. However, there is an opportunity for them to be significantly more profitable than events that limit participation to organizational or club members. 3) Club (or school) organizes an event open to the community and/or feeder schools: These events are for the club that wants to not only raise funds, but make an impact on the entire community. We will work with you to ensure that people leave with amazing memories and positive impressions of your entire organization....which hopefully turn one time event participants into people who support your organization for years to come! The advantage is the sky is the limit when it comes to being creative. Your students not only participate, but help create something that did not exist before --- possibly one of the strongest things to have on resumes for college and scholarship. The disadvantage is that the first year will require more time to orchestrate a new experience. However, we emphasize much of this work will only be needed the first year. It will get easier and less time consuming as your new tradition continues. WHAT IS THE EOP EXPERIENCE FOR SCHOOLS? No two events are alike! Your experience will be customized to fit the needs and goals of your school. We have events appropriate for elementary, middle, high school, and college. Regardless of what experiences you choose, one thing is certain. Your students and staff will NEVER forget it! Call Emerald Owl Productions at (252) 764-7628 or (412) 713-6517. Your EOP Experience will consist of any or all of the following experiences: • PROFESSIONAL Laser Light Glow Party • Laser Show • SLIME a teacher, principal, or coach (OR let the teachers slime some students!!!) • EPIC Water Battle (students vs teachers, grade vs grade, etc.) • Foam Party • Glow in the Dark Paint Battle PLUS EDUCATIONAL COMPONENTS: • STEAM: \"Mixing Science, Art, & Math to Create Your Laser Show Glow Party\" • \"The Business of Making Slime\" • Ask about our SEA MIST program for Student Entrepreneurs Watch this video to hear student reactions to our events! NON-PROFITS: We have several plans for non-profits other than schools, including large scale public events for your cause, as well as fun activities and challenges to generate revenue. Depending on your goals and your anticipated outreach, we will use our experience to customize a plan with you. If you are a non-profit other than a school and want to learn more, please call us at (252) 764-7628 or e-mail [email protected] Fundraisers Emerald Owl Productions OUR TEAM OUR STORY CONTACT US BLOG TERMS OF USE PRIVACY POLICY FOLLOW US Copyright 2025. Emerald Owl Productions.\nAll Rights Reserved.",
    "sections": []
  },
  "resources": [
    {
      "type": "image",
      "url": "https://storage.googleapis.com/msgsndr/d2BYZGOF7ecSj21A0t4N/media/6704204d9d9a095a00d5b580.png",
      "alt": "Emerald Owl Productions",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://images.leadconnectorhq.com/image/f_webp/q_80/r_1200/u_https://assets.cdn.filesafe.space/d2BYZGOF7ecSj21A0t4N/media/673ae487d88b414924ea8d0a.jpeg",
      "alt": "",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://images.leadconnectorhq.com/image/f_webp/q_80/r_1200/u_https://assets.cdn.filesafe.space/d2BYZGOF7ecSj21A0t4N/media/6738436ff5dd355a9c77c78e.png",
      "alt": "",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://images.leadconnectorhq.com/image/f_webp/q_80/r_1200/u_https://assets.cdn.filesafe.space/d2BYZGOF7ecSj21A0t4N/media/673234a9666f1d798acc937e.jpeg",
      "alt": "",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://images.leadconnectorhq.com/image/f_webp/q_80/r_1200/u_https://assets.cdn.filesafe.space/d2BYZGOF7ecSj21A0t4N/media/671fb9850b52952b979e066f.png",
      "alt": "",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://images.leadconnectorhq.com/image/f_webp/q_80/r_1200/u_https://assets.cdn.filesafe.space/d2BYZGOF7ecSj21A0t4N/media/6704204d9d9a095a00d5b580.png",
      "alt": "",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/facebook-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/instagram-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/linkedin-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/youtube-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    }
  ]
}