{
  "url": "https://emeraldowlproductions.com/our-story",
  "title": "Our Story",
  "route": "/our-story",
  "meta": {
    "description": "",
    "keywords": ""
  },
  "content": {
    "main_text": "Home Our Experiences Laser Light Show The Safest Experience in the Sky Unique Benefits of Hosting a Laser Show Neon Nights Foam Parties Water Games Dripping in Confidence Gunge Sensory Friendly Experiences Do It Now Coming Soon Special Occasions Upcoming Events Holiday Events America's 250th Anniversary Fundraisers Emmy The Owl Contact Us More... Our Story Our Team Gallery Blog Careers Our Story Our Story Our Story The concept of Emerald Owl Productions, Inc. was formed by students at Cedar Creek Middle School in Youngsville, North Carolina who wanted to know how they could help in the days just after 9/11/2001. The students had three ideas that all proved to be true: 1) Students need more fun, safe, interactive experiences to keep out of trouble. 2) If students are provided a meaningful way to get involved and feel they matter, they will respond. 3) These experiences create positive memories, teach valuable lessons, and can be fantastic fundraisers. These ideas led to the creation of a Dance Marathon at Cedar Creek, which stemmed from the Penn State University THON, the largest student-run charity event in the world! Since the Penn State Dance Marathon began in 1973, dance marathons have started at universities, high schools, and middle schools throughout the country. The Dance Marathon model is results oriented, an opportunity to give back, and fun. From our nation's largest tragedy was born adolescents wanting to make a positive difference, give back to others, and find purpose in their own lives. Over a span of 13 years, middle school students raised $151,199.72 PROFIT for various charities. Students and staff learned that an event can be more fulfilling than selling products. Emerald Owl Productions was founded in 2015 to replicate the success of the Dance Marathon and to keep the vision of the youth alive by sharing the gift of service and memories via epic events to others. Mission Our mission is to help our partners build connections with their customers by creating life long memories through epic events. Vision Our vision is to create unique, interactive, and memorable experiences that unite people of all ages and backgrounds. If we focus on giving participants the best experience possible, our partner's fundraising goals will take care of themselves. Goals Create positive memories for our partners and their participants Create a superior experience that is interactive, family friendly, and fun for all ages. Help organizations raise money by building a self sustaining event -- We do this by adding incredible value to events, which leads to increased future participation profits Emerald Owl Productions OUR TEAM OUR STORY CONTACT US BLOG TERMS OF USE PRIVACY POLICY FOLLOW US Copyright 2025. Emerald Owl Productions.\nAll Rights Reserved.",
    "sections": []
  },
  "resources": [
    {
      "type": "image",
      "url": "https://storage.googleapis.com/msgsndr/d2BYZGOF7ecSj21A0t4N/media/6704204d9d9a095a00d5b580.png",
      "alt": "Emerald Owl Productions",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://images.leadconnectorhq.com/image/f_webp/q_80/r_1200/u_https://assets.cdn.filesafe.space/d2BYZGOF7ecSj21A0t4N/media/6704204d9d9a095a00d5b580.png",
      "alt": "",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/facebook-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/instagram-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/linkedin-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/youtube-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    }
  ]
}