{
  "url": "https://emeraldowlproductions.com/terms-of-use",
  "title": "Emerald Owl Productions Terms of Use",
  "route": "/terms-of-use",
  "meta": {
    "description": "",
    "keywords": ""
  },
  "content": {
    "main_text": "Home Our Experiences Laser Light Show The Safest Experience in the Sky Unique Benefits of Hosting a Laser Show Neon Nights Foam Parties Water Games Dripping in Confidence Gunge Sensory Friendly Experiences Do It Now Coming Soon Special Occasions Upcoming Events Holiday Events America's 250th Anniversary Fundraisers Emmy The Owl Contact Us More... Our Story Our Team Gallery Blog Careers Emerald Owl Productions Terms of Use Emerald Owl Productions Terms of Use Last Updated: 10/19/2024 Welcome to Emerald Owl Productions! These Terms of Use (\"Terms\") govern your access to and use of the website located at [your website URL] (the \"Website\"), operated by Emerald Owl Productions (\"we,\" \"us,\" or \"our\"). By accessing or using this Website, you agree to comply with and be bound by these Terms. Please read them carefully. 1. Acceptance of Terms By accessing, browsing, or using the Website, you acknowledge that you have read, understood, and agree to be bound by these Terms. If you do not agree to these Terms, please do not use the Website. 2. Eligibility You must be at least 18 years old or the age of majority in your jurisdiction to use this Website. By using the Website, you represent and warrant that you meet this eligibility requirement. 3. Changes to Terms We reserve the right to modify these Terms at any time without prior notice. Your continued use of the Website after any changes constitutes your acceptance of the revised Terms. We encourage you to review these Terms regularly. 4. Use of the Website You agree to use the Website in compliance with all applicable laws and regulations. You are prohibited from using the Website to: - Engage in unlawful or fraudulent activity; - Distribute harmful software, viruses, or other malicious code; - Violate the rights of others, including intellectual property rights; - Interfere with the security, functionality, or accessibility of the Website. 5. Intellectual Property All content on the Website, including text, graphics, logos, images, and software, is the property of Emerald Owl Productions or its licensors and is protected by copyright, trademark, and other intellectual property laws. You may not reproduce, distribute, modify, or create derivative works of any content without our express written permission. 6. User-Generated Content If the Website allows you to submit, post, or share content (e.g., comments, reviews, etc.), you agree that you are solely responsible for such content. You grant us a non-exclusive, royalty-free, perpetual, and irrevocable right to use, display, and distribute your content in connection with the Website. You agree not to submit content that: - Is unlawful, defamatory, or otherwise offensive; - Violates the intellectual property rights of others; - Contains harmful or malicious software. We reserve the right to remove any content that violates these Terms or is otherwise inappropriate. 7. Third-Party Links The Website may contain links to third-party websites or services. These links are provided for your convenience, and we are not responsible for the content, privacy practices, or terms of use of any third-party websites. 8. Disclaimer of Warranties THE WEBSITE IS PROVIDED ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS. WE MAKE NO REPRESENTATIONS OR WARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, REGARDING THE OPERATION OF THE WEBSITE OR THE INFORMATION, CONTENT, OR MATERIALS INCLUDED ON THE WEBSITE. TO THE FULLEST EXTENT PERMISSIBLE BY APPLICABLE LAW, WE DISCLAIM ALL WARRANTIES, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. 9. Limitation of Liability IN NO EVENT SHALL WE OR OUR AFFILIATES, OFFICERS, DIRECTORS, EMPLOYEES, OR AGENTS BE LIABLE FOR ANY INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL, OR PUNITIVE DAMAGES ARISING OUT OF OR IN CONNECTION WITH YOUR USE OF THE WEBSITE, WHETHER BASED ON CONTRACT, TORT, STRICT LIABILITY, OR OTHERWISE, EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. 10. Indemnification You agree to indemnify, defend, and hold harmless Emerald Owl Productions, its affiliates, officers, directors, employees, and agents from and against any and all claims, liabilities, damages, losses, costs, and expenses, including reasonable attorneys' fees, arising from or related to your use of the Website, your violation of these Terms, or your violation of any third-party rights. 11. Governing Law and Jurisdiction These Terms are governed by and construed in accordance with the laws of the State of North Carolina, without regard to its conflict of law principles. Any legal action arising out of or relating to these Terms or the Website shall be brought exclusively in the state or federal courts located in Carteret County, North Carolina. 12. Termination We reserve the right to terminate or suspend your access to the Website, without notice, for conduct that we believe violates these Terms or is otherwise harmful to us or other users of the Website. 13. Contact Information If you have any questions or concerns about these Terms, please contact us at: Emerald Owl Productions [email protected] 252.764.7628 --- By using this Website, you acknowledge that you have read, understood, and agree to these Terms of Use. Emerald Owl Productions OUR TEAM OUR STORY CONTACT US BLOG TERMS OF USE PRIVACY POLICY FOLLOW US Copyright 2025. Emerald Owl Productions.\nAll Rights Reserved.",
    "sections": []
  },
  "resources": [
    {
      "type": "image",
      "url": "https://storage.googleapis.com/msgsndr/d2BYZGOF7ecSj21A0t4N/media/6704204d9d9a095a00d5b580.png",
      "alt": "Emerald Owl Productions",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://images.leadconnectorhq.com/image/f_webp/q_80/r_1200/u_https://assets.cdn.filesafe.space/d2BYZGOF7ecSj21A0t4N/media/6704204d9d9a095a00d5b580.png",
      "alt": "",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/facebook-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/instagram-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/linkedin-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    },
    {
      "type": "image",
      "url": "https://stcdn.leadconnectorhq.com/funnel/icons/square/youtube-square.svg",
      "alt": "social media icon",
      "width": "",
      "height": ""
    }
  ]
}